#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['andrey', 'katya', 'darina', 'maxim',]


# список списков приблизителного роста членов вашей семьи
my_family_height = ['andrey', 176], ['katya', 160], ['darina', 100], ['maxim', 80]
    # ['имя', рост],


# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

print ('Рост', my_family [0], my_family_height [0] [1], '- см')

# Выведите на ко